tap "aws/tap"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/brewdler"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "moncho/dry"
tap "neovim/neovim"
tap "rcmdnk/file"
tap "rogual/neovim-dot-app"
tap "sanemat/font"
tap "universal-ctags/universal-ctags"
brew "gdbm"
brew "openssl@3" # openssl@1.1を置き換え
brew "xz"
# brew "ansible"
brew "anyenv"
brew "apr"
brew "apr-util"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "berkeley-db", link: true
brew "lz4"
brew "boost"
brew "cabextract"
brew "glib"
brew "pkg-config"
brew "coreutils"
brew "libtool"
brew "guile"
brew "libevent"
brew "gnutls"
brew "cask"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "libssh2"
brew "openldap"
brew "curl"
brew "freetds"
brew "krb5"
brew "libpq"
brew "oniguruma"
brew "composer"
brew "cscope"
brew "ctags"
brew "go"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "harfbuzz"
brew "libspiro"
brew "libuninameslist"
brew "pango"
brew "fontforge"
brew "freexl"
brew "libxml2"
brew "libspatialite"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdk-pixbuf"
brew "ghq"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gobject-introspection"
brew "openjdk"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "hidapi"
brew "ncurses"
brew "htop"
brew "httpie"
brew "hub"
brew "libusb"
brew "libusbmuxd"
brew "ideviceinstaller"
brew "shared-mime-info"
brew "imagemagick"
brew "imagemagick@6"
brew "ios-deploy"
brew "jemalloc"
brew "jenkins"
brew "jq"
brew "libcroco"
brew "libusb-compat"
brew "libgphoto2"
brew "libksba"
brew "libslirp"
brew "unibilium"
brew "libuv"
brew "libvorbis"
brew "lua"
brew "vim", args: ["--with-override-system-vi"], link: false  # vimをオーバーライドせず
brew "macvim", link: true  # macvimをリンク
brew "makedepend"
brew "mas"
brew "maven"
brew "memcached"
brew "mercurial"
brew "msgpack"
brew "zlib"
brew "mysql"
brew "neovim"
brew "net-snmp"
brew "nkf"
brew "node", link: true  # nodeをリンク
brew "nsq"
brew "openapi-generator"
brew "p7zip"
brew "pandoc"
brew "peco"
brew "pipenv"
brew "poetry"
brew "poppler-qt5"
brew "postgresql"
brew "prettier"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tcl-tk", link: true  # tcl-tkをリンク
brew "python"  # 最新のpythonを使用
brew "qemu"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "sane-backends"
brew "scons"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sl"
brew "socat"
brew "spatialite-tools"
brew "sphinx-doc", link: true  # sphinx-docをリンク
brew "utf8proc"
brew "subversion"
brew "swagger-codegen"
# brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "yt-dlp"  # youtube-dlの代わり
brew "zsh"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
brew "heroku/brew/heroku"
brew "moncho/dry/dry"
brew "rcmdnk/file/brew-file"
brew "sanemat/font/ricty", args: ["with-powerline"]
cask "1password"
cask "alfred"
cask "alt-tab"
cask "androidtool"
cask "appcleaner"
cask "avira-antivirus"
cask "bettertouchtool"
cask "chatwork"
cask "clipy"
cask "dash"
cask "dbeaver-community"
cask "devutils"
cask "discord"
cask "diskwave"
cask "dropbox"
cask "evernote"
cask "firealpaca"
cask "firefox"
cask "font-myrica"
cask "funter"
cask "gitkraken"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepingyouawake"
cask "libreoffice"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "mtmr"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postman"
cask "pycharm"
cask "quicklook-json"
cask "raycast"
cask "react-studio"
cask "scroll-reverser"
cask "sketch"
cask "sourcetree"
cask "spotify"
cask "sublime-text"
cask "synergy"
cask "unity"
cask "unity-hub"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "xquartz"
cask "yacreader"
cask "zoom"
mas "Battery Monitor", id: 836505650
mas "BetterSnapTool", id: 417375580
mas "ComicViewer", id: 1455702185
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Joystick Mapper", id: 528183797
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "ToyViewer", id: 414298354
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
mas "WebP Viewer", id: 1323414118
mas "Xcode", id: 497799835
